# ReshapeFromFacetsFailures Properties

---
The BuiltInFailuresReshapeFromFacetsFailures type exposes the following members.
| Name| Description
---|---|---
| ReshapeFromFacetsFailed|  Reshape from facets failed. [Description]
| ReshapeFromFacetsFailedError|  Reshape from facets failed. [Description]
Top
#### Reference
BuiltInFailuresReshapeFromFacetsFailures Class
Autodesk.Revit.DB Namespace